CD2DEllipse.#ctor(CD2DPointF!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,CD2DSizeF!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Constructs a CD2DEllipse from CD2DPointF and CD2DSizeF objects.
ptCenter: The center point of the ellipse.
sizeRadius: The X-radius and Y-radius of the ellipse.

CD2DEllipse.#ctor(D2D1_ELLIPSE!System.Runtime.CompilerServices.IsConst*)
Constructs a CD2DEllipse object from D2D1_ELLIPSE object.
ellipse: source ellipse

CD2DEllipse.#ctor(D2D1_ELLIPSE!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Constructs a CD2DEllipse object from D2D1_ELLIPSE object.
ellipse: source ellipse

CD2DEllipse.#ctor(CD2DRectF!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Constructs a CD2DEllipse object from CD2DRectF object.
rect: source rectangle

CD2DEllipse
D2D1_ELLIPSE wrapper